Revit 2026 API

# MacroManagerIterator Class

---

An iterator to a MacroManager.

SystemObject Autodesk.Revit.DB.MacrosMacroManagerIterator

**Namespace:** Autodesk.Revit.DB.Macros**Assembly:** RevitAPIMacros (in RevitAPIMacros.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class MacroManagerIterator : IEnumerator<MacroModule>
```
```vb
Public Class MacroManagerIterator
	Implements IEnumerator(Of MacroModule)
```
```cpp
public ref class MacroManagerIterator : IEnumerator<MacroModule^>
```
```fsharp
type MacroManagerIterator =
    class
        interface IEnumerator<MacroModule>
    end
```

The MacroManagerIterator type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Current | Gets the item at the current position of the iterator. |
|  | CurrentObject |  |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |

|  | Name | Description |
| --- | --- | --- |
|  | Dispose | Releases all resources used by the MacroManagerIterator |
|  | Equals | Determines whether the specified object is equal to the current object.(Inherited from Object) |
|  | GetCurrent | Returns the current Macro module. |
|  | GetHashCode | Serves as the default hash function.(Inherited from Object) |
|  | GetType | Gets the Type of the current instance.(Inherited from Object) |
|  | IsDone | Identifies if the iteration has completed. |
|  | MoveNext | Increments the iterator to the next item. |
|  | Reset | Resets the iterator to the initial state. |
|  | ToString | Returns a string that represents the current object.(Inherited from Object) |

#### Reference

Autodesk.Revit.DB.Macros Namespace